import * as _ from 'lodash';
import { cloneStub, generateImage } from '../helpers/stub-helpers';


const CommonStub = {
  'promo': {
    'title': {
      'ge': 'მეგობრული გარემო თქვენი ოთხფეხა მეგობრისთვის',
      'en': 'title en',
      'ru': 'title ru'
    },
    'image': { url: generateImage()},
  },
  'contacts': {
    'email': 'info@pide.ge',
    'phone': '551085478',
  },
  'aboutUs': {
    'content': {
      'ge': 'My nanny ციფრული მარკეტფლეისია, რომელიც დაინტერესებულ მშობლებსა და ძიძებს ერთმანეთთან აკავშირებს. პლატფორმა მშობლებს გადაუდებელი და დროებითი საჭიროების შემთხვევაში ბავშვზე ზრუნვის კომფორტულ და უსაფრთხო სერვისს სთავაზობს! მათ კი, ვისაც ბავშვებთან ურთიერთობა უყვარს, ენერგიული, აქტიური და კრეატიულია შესაძლებლობას აძლევს იპოვოს ძიძის სამუშაო მასზე მორგებული გრაფიკით! დროებითი ძიძის კონცეფტი სიახლეა ქართულ რეალობაში და მისი გამოჩენა ბევრ მშობელს გაუმარტივებს ცხოვრებას. მშობლები, ბუნებრივია, ბევრ რამეს ვთმობთ ჩვენი პატარებისთვის. თუმცა პროფესიულ განვითარებზე ან თუნდაც სოციალურ ცხოვრებაზე უარის თქმა საჭირო არ არის, როცა ბავშვზე ზრუნვის სანდო სერვისი მარტივად ხელმისაწვდომია: სამსახურში გვიანობამდე გიწევს დარჩენა და ბავშვის სკოლიდან გამოყვანა და რამდენიმე საათით მიხედვა გჭირდება? რეგულარულ ძიძას შვებულება აქვს და შემცვლელი უნდა იპოვო მოკლე ვადით აგარაკზე რომ გამოგყვეს? საღამოს მეუღლესთან ერთად გინდა რომანტიულ ვახშამზე გასვლა? ბავშვს რთული საშინაო დავალება აქვს და შესაბამისი ცოდნის ადამიანი გჭირდება, რომ რთული მასალა აუხსნას? შვილის დაბადების დღეზე რამდენიმე საათით გჭირდება ძიძა ბავშვებთან მხიარულ აქტივობებში რომ ჩაერთოს? ან, სულაც, კვირა დილით ყავა გინდა მშვიდად დალიო და ძალები აღიდგინო? თანამედროვე საქმიან მშობლებს ასეთი საჭიროებების გრძელი ნუსხა აქვთ... ხშირად რეგულარული ძიძაც კი არ არის საკმარისი, რადგან სერვისი საღამოს, შაბათ-კვირას ან შვებულების პერიოდში არის საჭირო. თანაც, უნივერსალური ცოდნისა და უნარების მქონე ადამიანის მოძებნაც რთულია, ყველა საჭიროებისთვის რომ გამოგადგეს - საშინაო დავალებების მომზადებაშიც რომ დაეხმაროს ბავშვს, აქტიურ გასართობებშიც რომ ჩაერთოს და დიასახლისური საქმეებსაც გაართვას თავი. სწორედ ამიტომ, ჩვენ გთავაზობთ დროებითი ძიძების არჩევანს კონკრეტული საჭიროებისათვის - იქირავე როცა გჭირდება, გამოიყენე მოკლე დროით და გამოიძახე ადამიანი, ვისაც შესაბამისი უნარები და გამოცდილება აქვს! უცხო ადამიანის ნდობა რთულია? უსაფრთხოება ჩვენთვისაც უმნიშვნელოვანესია. ნებისმიერი ძიძა ჩვენს პლატფორმაზე მოხვედრამდე რამდენიმე ეტაპიან შემოწმებას გაივლის. ჩვენ ასევე ვაძლევთ მშობლებს საშუალებას საკუთარი სოციალური ქსელის ინტეგრაციით ნახონ თავისივე მეგობრების ფავორიტი ძიძები და სწორედ მათგან შეარჩიოთ კონკრეტული სერვისისთვის შესაფერისი კანდიდატი. სერვისი დაუყოვნებლივ გჭირდებათ? ჭკვიანი პლატფორმა თქვენი მოთხოვნების მიხედვით ძიძების გაფილტვრის მარტივ მეთოდს გთავაზობთ და სასურველ კანდიდატთან დაუყოვნებლივ გაკავშირებთ. ძიძების სერვისისთვის მზაობის საკითხი გაღელვებთ? ჩვენ უზრუნველვყოფთ ძიძებს გადამზადებას სავალდებულო სატრენინგო კურისის მეშვეობით. გგონიათ, რომ ძიძა არ იქნება მზად განსაკუთრებულ საჭიროებებთან გასამკლავებლად? ძიძების ტრენინგი განსაკუთრებული საჭიროებების ბავშვებზე ზრუნვის საკითებსაც ითვალისწინებს. პლატფორმაზე რეგისტრაცია უფასოა მშობლისთვისაც და ძიძისთვისაც. ძიძა თავად აწესებს სერვისის ღირებულებას, რასაც პლატფორმის საკომისიო ემატება (15%). სერვისის ღირებულების გადახდა ონლაინ, პლატფორმაზევე ხორციელდება, სერვისის დასრულების შემდეგ. მშობლისა და ძიძის სავადლებულო შეფასების სისტემა ხარისხის მაღალი სტანდარტის შენარჩუნებაში გვეხმარება. ვიცით, მშობლობა იოლი არ არის, ჩვენთან ბევრი არაჩვეულებრივი ძიძაა თქვენს შვილებსაც რომ მოეწონება და თქვენც უამრავ სტრესს აგარიდებთ. სასურველი კანდიდატის მოძებნაში ჩვენ დაგეხმარებით!',
      'en': 'content en',
      'ru': 'content ru'
    },
    'banner': { url: generateImage()},
  },
  'policy': {
    'content': {
      'ge': 'My nanny ციფრული მარკეტფლეისია, რომელიც დაინტერესებულ მშობლებსა და ძიძებს ერთმანეთთან აკავშირებს. პლატფორმა მშობლებს გადაუდებელი და დროებითი საჭიროების შემთხვევაში ბავშვზე ზრუნვის კომფორტულ და უსაფრთხო სერვისს სთავაზობს! მათ კი, ვისაც ბავშვებთან ურთიერთობა უყვარს, ენერგიული, აქტიური და კრეატიულია შესაძლებლობას აძლევს იპოვოს ძიძის სამუშაო მასზე მორგებული გრაფიკით! დროებითი ძიძის კონცეფტი სიახლეა ქართულ რეალობაში და მისი გამოჩენა ბევრ მშობელს გაუმარტივებს ცხოვრებას. მშობლები, ბუნებრივია, ბევრ რამეს ვთმობთ ჩვენი პატარებისთვის. თუმცა პროფესიულ განვითარებზე ან თუნდაც სოციალურ ცხოვრებაზე უარის თქმა საჭირო არ არის, როცა ბავშვზე ზრუნვის სანდო სერვისი მარტივად ხელმისაწვდომია: სამსახურში გვიანობამდე გიწევს დარჩენა და ბავშვის სკოლიდან გამოყვანა და რამდენიმე საათით მიხედვა გჭირდება? რეგულარულ ძიძას შვებულება აქვს და შემცვლელი უნდა იპოვო მოკლე ვადით აგარაკზე რომ გამოგყვეს? საღამოს მეუღლესთან ერთად გინდა რომანტიულ ვახშამზე გასვლა? ბავშვს რთული საშინაო დავალება აქვს და შესაბამისი ცოდნის ადამიანი გჭირდება, რომ რთული მასალა აუხსნას? შვილის დაბადების დღეზე რამდენიმე საათით გჭირდება ძიძა ბავშვებთან მხიარულ აქტივობებში რომ ჩაერთოს? ან, სულაც, კვირა დილით ყავა გინდა მშვიდად დალიო და ძალები აღიდგინო? თანამედროვე საქმიან მშობლებს ასეთი საჭიროებების გრძელი ნუსხა აქვთ... ხშირად რეგულარული ძიძაც კი არ არის საკმარისი, რადგან სერვისი საღამოს, შაბათ-კვირას ან შვებულების პერიოდში არის საჭირო. თანაც, უნივერსალური ცოდნისა და უნარების მქონე ადამიანის მოძებნაც რთულია, ყველა საჭიროებისთვის რომ გამოგადგეს - საშინაო დავალებების მომზადებაშიც რომ დაეხმაროს ბავშვს, აქტიურ გასართობებშიც რომ ჩაერთოს და დიასახლისური საქმეებსაც გაართვას თავი. სწორედ ამიტომ, ჩვენ გთავაზობთ დროებითი ძიძების არჩევანს კონკრეტული საჭიროებისათვის - იქირავე როცა გჭირდება, გამოიყენე მოკლე დროით და გამოიძახე ადამიანი, ვისაც შესაბამისი უნარები და გამოცდილება აქვს! უცხო ადამიანის ნდობა რთულია? უსაფრთხოება ჩვენთვისაც უმნიშვნელოვანესია. ნებისმიერი ძიძა ჩვენს პლატფორმაზე მოხვედრამდე რამდენიმე ეტაპიან შემოწმებას გაივლის. ჩვენ ასევე ვაძლევთ მშობლებს საშუალებას საკუთარი სოციალური ქსელის ინტეგრაციით ნახონ თავისივე მეგობრების ფავორიტი ძიძები და სწორედ მათგან შეარჩიოთ კონკრეტული სერვისისთვის შესაფერისი კანდიდატი. სერვისი დაუყოვნებლივ გჭირდებათ? ჭკვიანი პლატფორმა თქვენი მოთხოვნების მიხედვით ძიძების გაფილტვრის მარტივ მეთოდს გთავაზობთ და სასურველ კანდიდატთან დაუყოვნებლივ გაკავშირებთ. ძიძების სერვისისთვის მზაობის საკითხი გაღელვებთ? ჩვენ უზრუნველვყოფთ ძიძებს გადამზადებას სავალდებულო სატრენინგო კურისის მეშვეობით. გგონიათ, რომ ძიძა არ იქნება მზად განსაკუთრებულ საჭიროებებთან გასამკლავებლად? ძიძების ტრენინგი განსაკუთრებული საჭიროებების ბავშვებზე ზრუნვის საკითებსაც ითვალისწინებს. პლატფორმაზე რეგისტრაცია უფასოა მშობლისთვისაც და ძიძისთვისაც. ძიძა თავად აწესებს სერვისის ღირებულებას, რასაც პლატფორმის საკომისიო ემატება (15%). სერვისის ღირებულების გადახდა ონლაინ, პლატფორმაზევე ხორციელდება, სერვისის დასრულების შემდეგ. მშობლისა და ძიძის სავადლებულო შეფასების სისტემა ხარისხის მაღალი სტანდარტის შენარჩუნებაში გვეხმარება.',
      'en': 'policy en',
      'ru': 'policy ru'
    },
    'banner': { url: generateImage()},
  },
  'privacy': {
    'content': {
      'ge': 'My nanny ციფრული მარკეტფლეისია, რომელიც დაინტერესებულ მშობლებსა და ძიძებს ერთმანეთთან აკავშირებს. პლატფორმა მშობლებს გადაუდებელი და დროებითი საჭიროების შემთხვევაში ბავშვზე ზრუნვის კომფორტულ და უსაფრთხო სერვისს სთავაზობს! მათ კი, ვისაც ბავშვებთან ურთიერთობა უყვარს, ენერგიული, აქტიური და კრეატიულია შესაძლებლობას აძლევს იპოვოს ძიძის სამუშაო მასზე მორგებული გრაფიკით! დროებითი ძიძის კონცეფტი სიახლეა ქართულ რეალობაში და მისი გამოჩენა ბევრ მშობელს გაუმარტივებს ცხოვრებას. მშობლები, ბუნებრივია, ბევრ რამეს ვთმობთ ჩვენი პატარებისთვის. თუმცა პროფესიულ განვითარებზე ან თუნდაც სოციალურ ცხოვრებაზე უარის თქმა საჭირო არ არის, როცა ბავშვზე ზრუნვის სანდო სერვისი მარტივად ხელმისაწვდომია: სამსახურში გვიანობამდე გიწევს დარჩენა და ბავშვის სკოლიდან გამოყვანა და რამდენიმე საათით მიხედვა გჭირდება? რეგულარულ ძიძას შვებულება აქვს და შემცვლელი უნდა იპოვო მოკლე ვადით აგარაკზე რომ გამოგყვეს? საღამოს მეუღლესთან ერთად გინდა რომანტიულ ვახშამზე გასვლა? ბავშვს რთული საშინაო დავალება აქვს და შესაბამისი ცოდნის ადამიანი გჭირდება, რომ რთული მასალა აუხსნას? შვილის დაბადების დღეზე რამდენიმე საათით გჭირდება ძიძა ბავშვებთან მხიარულ აქტივობებში რომ ჩაერთოს? ან, სულაც, კვირა დილით ყავა გინდა მშვიდად დალიო და ძალები აღიდგინო? თანამედროვე საქმიან მშობლებს ასეთი საჭიროებების გრძელი ნუსხა აქვთ... ხშირად რეგულარული ძიძაც კი არ არის საკმარისი, რადგან სერვისი საღამოს, შაბათ-კვირას ან შვებულების პერიოდში არის საჭირო. თანაც, უნივერსალური ცოდნისა და უნარების მქონე ადამიანის მოძებნაც რთულია, ყველა საჭიროებისთვის რომ გამოგადგეს - საშინაო დავალებების მომზადებაშიც რომ დაეხმაროს ბავშვს, აქტიურ გასართობებშიც რომ ჩაერთოს და დიასახლისური საქმეებსაც გაართვას თავი. სწორედ ამიტომ, ჩვენ გთავაზობთ დროებითი ძიძების არჩევანს კონკრეტული საჭიროებისათვის - იქირავე როცა გჭირდება, გამოიყენე მოკლე დროით და გამოიძახე ადამიანი, ვისაც შესაბამისი უნარები და გამოცდილება აქვს! უცხო ადამიანის ნდობა რთულია? უსაფრთხოება ჩვენთვისაც უმნიშვნელოვანესია. ნებისმიერი ძიძა ჩვენს პლატფორმაზე მოხვედრამდე რამდენიმე ეტაპიან შემოწმებას გაივლის. ჩვენ ასევე ვაძლევთ მშობლებს საშუალებას საკუთარი სოციალური ქსელის ინტეგრაციით ნახონ თავისივე მეგობრების ფავორიტი ძიძები და სწორედ მათგან შეარჩიოთ კონკრეტული სერვისისთვის შესაფერისი კანდიდატი. სერვისი დაუყოვნებლივ გჭირდებათ? ჭკვიანი პლატფორმა თქვენი მოთხოვნების მიხედვით ძიძების გაფილტვრის მარტივ მეთოდს გთავაზობთ და სასურველ კანდიდატთან დაუყოვნებლივ გაკავშირებთ. ძიძების სერვისისთვის მზაობის საკითხი გაღელვებთ? ჩვენ უზრუნველვყოფთ ძიძებს გადამზადებას სავალდებულო სატრენინგო კურისის მეშვეობით. გგონიათ, რომ ძიძა არ იქნება მზად განსაკუთრებულ საჭიროებებთან გასამკლავებლად? ძიძების ტრენინგი განსაკუთრებული საჭიროებების ბავშვებზე ზრუნვის საკითებსაც ითვალისწინებს. პლატფორმაზე რეგისტრაცია უფასოა მშობლისთვისაც და ძიძისთვისაც. ძიძა თავად აწესებს სერვისის ღირებულებას, რასაც პლატფორმის საკომისიო ემატება (15%). სერვისის ღირებულების გადახდა ონლაინ, პლატფორმაზევე ხორციელდება, სერვისის დასრულების შემდეგ. მშობლისა და ძიძის სავადლებულო შეფასების სისტემა ხარისხის მაღალი სტანდარტის შენარჩუნებაში გვეხმარება.',
      'en': 'privacy en',
      'ru': 'privacy ru'
    },
    'banner': { url: generateImage()},
  },
  'faqs': {
    'banner': { url: generateImage()},
  },
};

export function getSingle(fields?: any): any {
  return {
    ...cloneStub(CommonStub),
    ...fields
  };
}

export function getMany(count: number, fields?: any) {
  return _.range(count).map((i: number) => ({
    ...getSingle(),
    ...fields,
  }));
}