export const ge = {
  HEADER: {
    MENU: {
      HOME: 'მთავარი',
      BLOG: 'ბლოგი',
      ABOUT: 'ჩვენ შესახებ',
      CONTACT: 'კონტაქტი',
      FAQ: 'ხდკ',
    },
    BOOKING: 'დაჯავშნა'
  },
  HOME: {
    STORIES: {
      TITLE: 'ჩვენი მეგობრების ისტორიები'
    },
    HOW_TODO: {
      TITLE: 'როგორ დავჯავშნო სერვისი?',
      STEP_1: {
        TITLE: 'აირჩიე სერვისი',
        TEXT: 'აირჩიე სასურველი სერვისი',
      },
      STEP_2: {
        TITLE: 'დაამატე ძაღლი',
        TEXT: 'მოგვიყევი შენს ძაღლზე',
      },
      STEP_3: {
        TITLE: 'აირჩიე მომსახურების დრო',
        TEXT: 'გვითხარი როდის გჭირდება სერვისი',
      },
      STEP_4: {
        TITLE: 'დაელოდე რამდენიმე წუთი',
        TEXT: 'დაელოდე გამოხმაურებას და სულ ეგ არის!',
      },
    },
    WALKERS: {
      TITLE: 'მოთხოვნადი გამსეირნებლები',
    },
    WHY_PIDE: {
      TITLE: 'რატომ პაიდი',
      CARD_1: {
        TITLE: 'არ შეცვალო გეგმები',
        TEXT: ' შენი ცუგა ატარებს უზრუნველ დროს შენ კი მიჰყვები შენს გეგმებს',
      },
      CARD_2: {
        TITLE: 'დაჯავშნე მარტივად',
        TEXT: ' სერვისის დაჯავშნა არასდროს ყოფილა ასეთი მარტივი',
      },
      CARD_3: {
        TITLE: 'სანდოობა',
        TEXT: 'სანერვიულო არ გაქვს რადგან ძაღლს ტოვებ სანდო ხელში',
      }
    }
  },
  POLICY: 'წესები და პირობები',
  PRIVACY: 'კონფიდენციალურობის პოლიტიკა',
  FOOTER: {
    POLICY: 'წესები და პირობები',
    PRIVACY: 'კონფედენციალურობის პოლიტიკა',
    FOLLOW: 'გამოგვყევით',
    PIDE_LINKS: 'პაიდის ბმულები',
    APP_SOON: 'აპლიკაცია მალე',
  },
  ABOUT_US: 'ჩვენ შესახებ',
  CONTACT: {
    CONTACT: 'კონტაქტი',
    CONTACT_ADDICIONAL: 'დამატებითი კითხვების შემთხვევაში დაგვიკავშირდით:',
  },
  FAQS: 'ხშირად დასმული კითხვები'
}

export const en = {
  HEADER: {
    MENU: {
      HOME: 'Home',
      BLOG: 'Blog',
      ABOUT: 'About',
      CONTACT: 'Contact',
      FAQ: 'Faq',
    },
    BOOKING: 'Booking'
  },
  HOME: {
    STORIES: {
      TITLE: 'ჩვენი მეგობრების ისტორიები'
    },
    HOW_TODO: {
      TITLE: 'როგორ დავჯავშნო სერვისი?',
      STEP_1: {
        TITLE: 'აირჩიე სერვისი',
        TEXT: 'აირჩიე სასურველი სერვისი',
      },
      STEP_2: {
        TITLE: 'დაამატე ძაღლი',
        TEXT: 'მოგვიყევი შენს ძაღლზე',
      },
      STEP_3: {
        TITLE: 'აირჩიე მომსახურების დრო',
        TEXT: 'გვითხარი როდის გჭირდება სერვისი',
      },
      STEP_4: {
        TITLE: 'დაელოდე რამდენიმე წუთი',
        TEXT: 'დაელოდე გამოხმაურებას და სულ ეგ არის!',
      },
    },
    WALKERS: {
      TITLE: 'მოთხოვნადი გამსეირნებლები',
    },
    WHY_PIDE: {
      TITLE: 'რატომ პაიდი',
      CARD_1: {
        TITLE: 'არ შეცვალო გეგმები',
        TEXT: ' შენი ცუგა ატარებს უზრუნველ დროს შენ კი მიჰყვები შენს გეგმებს',
      },
      CARD_2: {
        TITLE: 'დაჯავშნე მარტივად',
        TEXT: ' სერვისის დაჯავშნა არასდროს ყოფილა ასეთი მარტივი',
      },
      CARD_3: {
        TITLE: 'სანდოობა',
        TEXT: 'სანერვიულო არ გაქვს რადგან ძაღლს ტოვებ სანდო ხელში',
      }
    }
  },
  POLICY: 'წესები და პირობები',
  PRIVACY: 'კონფიდენციალურობის პოლიტიკა',
  FOOTER: {
    POLICY: 'Policy',
    PRIVACY: 'Privacy',
    FOLLOW: 'Follow',
    PIDE_LINKS: 'Pide links',
    APP_SOON: 'App soon',
  },
  ABOUT_US: 'ჩვენ შესახებ',
  CONTACT: {
    CONTACT: 'კონტაქტი',
    CONTACT_ADDICIONAL: 'დამატებითი კითხვების შემთხვევაში დაგვიკავშირდით:',
  },
  FAQS: 'ხშირად დასმული კითხვები'
}

export const ru = {
  HEADER: {
    MENU: {
      HOME: 'Главная',
      BLOG: 'Блог',
      ABOUT: 'О Компании',
      CONTACT: 'Контакты',
      FAQ: 'Вопросы',
    },
    BOOKING: 'Бронирование'
  },
  HOME: {
    STORIES: {
      TITLE: 'ჩვენი მეგობრების ისტორიები'
    },
    HOW_TODO: {
      TITLE: 'როგორ დავჯავშნო სერვისი?',
      STEP_1: {
        TITLE: 'აირჩიე სერვისი',
        TEXT: 'აირჩიე სასურველი სერვისი',
      },
      STEP_2: {
        TITLE: 'დაამატე ძაღლი',
        TEXT: 'მოგვიყევი შენს ძაღლზე',
      },
      STEP_3: {
        TITLE: 'აირჩიე მომსახურების დრო',
        TEXT: 'გვითხარი როდის გჭირდება სერვისი',
      },
      STEP_4: {
        TITLE: 'დაელოდე რამდენიმე წუთი',
        TEXT: 'დაელოდე გამოხმაურებას და სულ ეგ არის!',
      },
    },
    WALKERS: {
      TITLE: 'მოთხოვნადი გამსეირნებლები',
    },
    WHY_PIDE: {
      TITLE: 'რატომ პაიდი',
      CARD_1: {
        TITLE: 'არ შეცვალო გეგმები',
        TEXT: ' შენი ცუგა ატარებს უზრუნველ დროს შენ კი მიჰყვები შენს გეგმებს',
      },
      CARD_2: {
        TITLE: 'დაჯავშნე მარტივად',
        TEXT: ' სერვისის დაჯავშნა არასდროს ყოფილა ასეთი მარტივი',
      },
      CARD_3: {
        TITLE: 'სანდოობა',
        TEXT: 'სანერვიულო არ გაქვს რადგან ძაღლს ტოვებ სანდო ხელში',
      }
    }
  },
  POLICY: 'წესები და პირობები',
  PRIVACY: 'კონფიდენციალურობის პოლიტიკა',
  FOOTER: {
    POLICY: 'Policy',
    PRIVACY: 'Privacy',
    FOLLOW: 'Follow',
    PIDE_LINKS: 'Pide links',
    APP_SOON: 'App soon',
  },
  ABOUT_US: 'ჩვენ შესახებ',
  CONTACT: {
    CONTACT: 'კონტაქტი',
    CONTACT_ADDICIONAL: 'დამატებითი კითხვების შემთხვევაში დაგვიკავშირდით:',
  },
  FAQS: 'ხშირად დასმული კითხვები'
}